jackzfdai/wifi_camera/firmware/components/esp32-camera/driver/camera.c
static void IRAM_ATTR dma_filter_jpeg(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 4;
    // manually unrolling 4 iterations of the loop here
    for (size_t i = 0; i < end; ++i) {
        dst[0] = src[0].sample1;
        dst[1] = src[1].sample1;
        dst[2] = src[2].sample1;
        dst[3] = src[3].sample1;
        src += 4;
        dst += 4;
    }
}

static void IRAM_ATTR dma_filter_grayscale(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 4;
    for (size_t i = 0; i < end; ++i) {
        // manually unrolling 4 iterations of the loop here
        dst[0] = src[0].sample1;
        dst[1] = src[1].sample1;
        dst[2] = src[2].sample1;
        dst[3] = src[3].sample1;
        src += 4;
        dst += 4;
    }
}

static void IRAM_ATTR dma_filter_grayscale_highspeed(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 8;
    for (size_t i = 0; i < end; ++i) {
        // manually unrolling 4 iterations of the loop here
        dst[0] = src[0].sample1;
        dst[1] = src[2].sample1;
        dst[2] = src[4].sample1;
        dst[3] = src[6].sample1;
        src += 8;
        dst += 4;
    }
    // the final sample of a line in SM_0A0B_0B0C sampling mode needs special handling
    if ((dma_desc->length & 0x7) != 0) {
        dst[0] = src[0].sample1;
        dst[1] = src[2].sample1;
    }
}

static void IRAM_ATTR dma_filter_yuyv(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 4;
    for (size_t i = 0; i < end; ++i) {
        dst[0] = src[0].sample1;//y0
        dst[1] = src[0].sample2;//u
        dst[2] = src[1].sample1;//y1
        dst[3] = src[1].sample2;//v

        dst[4] = src[2].sample1;//y0
        dst[5] = src[2].sample2;//u
        dst[6] = src[3].sample1;//y1
        dst[7] = src[3].sample2;//v
        src += 4;
        dst += 8;
    }
}

volatile uint8_t dst_sample2 [38400];
volatile uint8_t done = 0;
static volatile uint32_t s2_index = 0;
volatile uint32_t test = 0;
volatile uint32_t s2 = 0;
volatile uint32_t u2 = 0;
volatile uint32_t s1 = 0;
volatile uint32_t u1 = 0;

static void IRAM_ATTR dma_filter_yuyv_highspeed(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
	dma_elem_t* src_orig = src;
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 8;
    for (size_t i = 0; i < end; ++i) {
        dst[0] = src[0].sample1;//y0
        dst[1] = src[1].sample1;//u
        dst[2] = src[2].sample1;//y1
        dst[3] = src[3].sample1;//v

        dst[4] = src[4].sample1;//y0
        dst[5] = src[5].sample1;//u
        dst[6] = src[6].sample1;//y1
        dst[7] = src[7].sample1;//v

        test = src[0].val;
        s2 = src[0].sample2;
        u2 = src[0].unused2;
        s1 = src[0].sample1;
        u1 = src[0].unused1;

        if (src == src_orig)
        {
            ESP_LOGI(TAG, "val %d, s2 %d, u2 %d, s1 %d, u1 %d\n", src[0].val, src[0].sample2, src[0].unused2, src[0].sample1, src[0].unused1);
        }
//        if(!done)
//        {
//        	dst_sample2[s2_index] = src[0].sample2;
//        	dst_sample2[s2_index + 1] = src[1].sample2;
//        	dst_sample2[s2_index + 2] = src[2].sample2;
//        	dst_sample2[s2_index + 3] = src[3].sample2;
//        	dst_sample2[s2_index + 4] = src[4].sample2;
//        	dst_sample2[s2_index + 5] = src[5].sample2;
//        	dst_sample2[s2_index + 6] = src[6].sample2;
//        	dst_sample2[s2_index + 7] = src[7].sample2;
//        	s2_index += 8;
//        }

        src += 8;
        dst += 8;
    }
    if ((dma_desc->length & 0x1F) != 0) { //TODO: check this why is it always 0?
        dst[0] = src[0].sample1;//y0
        dst[1] = src[1].sample1;//u
        dst[2] = src[2].sample1;//y1
        dst[3] = src[3].sample1;//v

        dst[4] = src[4].sample1; //y0
        dst[5] = src[5].sample1; //u
        dst[6] = src[6].sample1; //y1
//        dst[7] = src[6].sample2; //v
        dst[7] = src[7].sample1; //v

        ESP_LOGI(TAG, "val %d, s2 %d, u2 %d, s1 %d, u1 %d\n", src[7].val, src[7].sample2, src[7].unused2, src[7].sample1, src[7].unused1);

//        if(!done)
//        {
//        	dst_sample2[s2_index] = src[0].sample2;
//        	dst_sample2[s2_index + 1] = src[1].sample2;
//        	dst_sample2[s2_index + 2] = src[2].sample2;
//        	dst_sample2[s2_index + 3] = src[3].sample2;
//        	dst_sample2[s2_index + 4] = src[4].sample2;
//        	dst_sample2[s2_index + 5] = src[5].sample2;
//        	dst_sample2[s2_index + 6] = src[6].sample2;
//        	dst_sample2[s2_index + 7] = src[7].sample2;
//        	s2_index += 8;
//        }
        test = src[0].val;
        s2 = src[0].sample2;
        u2 = src[0].unused2;
        s1 = src[0].sample1;
        u1 = src[0].unused1;

    }

//    if (s2_index == 38400)
//    	done = 1;
}

static void IRAM_ATTR dma_filter_rgb888(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 4;
    uint8_t lb, hb;
    for (size_t i = 0; i < end; ++i) {
        hb = src[0].sample1;
        lb = src[0].sample2;
        dst[0] = (lb & 0x1F) << 3;
        dst[1] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[2] = hb & 0xF8;

        hb = src[1].sample1;
        lb = src[1].sample2;
        dst[3] = (lb & 0x1F) << 3;
        dst[4] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[5] = hb & 0xF8;

        hb = src[2].sample1;
        lb = src[2].sample2;
        dst[6] = (lb & 0x1F) << 3;
        dst[7] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[8] = hb & 0xF8;

        hb = src[3].sample1;
        lb = src[3].sample2;
        dst[9] = (lb & 0x1F) << 3;
        dst[10] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[11] = hb & 0xF8;
        src += 4;
        dst += 12;
    }
}

static void IRAM_ATTR dma_filter_rgb888_highspeed(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst)
{
    size_t end = dma_desc->length / sizeof(dma_elem_t) / 8;
    uint8_t lb, hb;
    for (size_t i = 0; i < end; ++i) {
        hb = src[0].sample1;
        lb = src[1].sample1;
        dst[0] = (lb & 0x1F) << 3;
        dst[1] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[2] = hb & 0xF8;

        hb = src[2].sample1;
        lb = src[3].sample1;
        dst[3] = (lb & 0x1F) << 3;
        dst[4] = (hb & 0x07) << 5 | (lb & 0xE0) >> 3;
        dst[5] = hb & 0xF8;

